app/controllers/api/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "favorites" ("favoriter_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["favoriter_id", 2], ["artwork_id", 3], ["created_at", "2021-05-20 13:01:33.846665"], ["updated_at", "2021-05-20 13:01:33.846665"]]
---
    def favorites
        @artwork = current_user.artworks.where(id: params[:id])
                puts "artwork foparamsund==>>#{params} current_user==>>#{current_user.inspect} length==>>#{@artwork.length}"
        puts "artwork found==>>#{@artwork.inspect}"
        if @artwork.length > 0
            current_user.artworks.delete(@artwork)
        else
            Favorite.create(favoriter_id: current_user.id, artwork_id: params[:id])