app/controllers/api/collected_artworks_controller.rb

SELECT  "galleries".* FROM "galleries" ORDER BY "galleries"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "collected_artworks" ("gallery_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["gallery_id", 10], ["artwork_id", 3], ["created_at", "2021-05-20 14:52:16.714457"], ["updated_at", "2021-05-20 14:52:16.714457"]]
---
    def create
        @gallery = Gallery.last
        if params[:collectedArtworks]
            params[:collectedArtworks].each do |artwork_id|
                CollectedArtwork.create(artwork_id: artwork_id, gallery_id: @gallery.id)

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "collected_artworks" WHERE "collected_artworks"."gallery_id" = $1  [["gallery_id", 7]]
INSERT INTO "collected_artworks" ("gallery_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["gallery_id", 10], ["artwork_id", 3], ["created_at", "2021-05-20 19:41:53.432764"], ["updated_at", "2021-05-20 19:41:53.432764"]]
---
    def recollect
        @gallery = Gallery.find_by(id: params[:id])
        CollectedArtwork.delete_all(gallery_id: params[:id])
        if params[:collectedArtworks]
            params[:collectedArtworks].each do |artwork_id|
                CollectedArtwork.create(artwork_id: artwork_id, gallery_id: @gallery.id)