app/controllers/api/galleries_controller.rb

    def index
        # @galleries = Gallery.all(:includes => :collected_artworks)
        @galleries = Gallery.all#joins(:collected_artworks)
---
SELECT "artworks".* FROM "artworks" INNER JOIN "collected_artworks" ON "artworks"."id" = "collected_artworks"."artwork_id" WHERE "collected_artworks"."gallery_id" = $1  [["gallery_id", 5]]
SELECT "galleries".* FROM "galleries" INNER JOIN "collected_artworks" ON "collected_artworks"."gallery_id" = "galleries"."id"

    def create
        @gallery = Gallery.new(gallery_params)
        @gallery.user_id = current_user.id
        if @gallery.save
---
INSERT INTO "galleries" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "cccc"], ["description", "heyyy2"], ["user_id", 2], ["created_at", "2021-05-20 15:15:00.234252"], ["updated_at", "2021-05-20 15:15:00.234252"]]

    def show
        @gallery = Gallery.find_by(id: params[:id])
---
SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def update
        @gallery = Gallery.find_by(id: params[:id])
        if @gallery.update(gallery_params)
---
SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "galleries" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "galleries"."id" = $4  [["title", "jjjjjjjjjcvv"], ["description", "cdff"], ["updated_at", "2021-05-20 19:29:38.981715"], ["id", 5]]

    def destroy
        @gallery = Gallery.find_by(id: params[:id])
        @gallery.destroy
---
SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "galleries" WHERE "galleries"."id" = $1  [["id", 1]]