app/views/api/galleries/_gallery.json.jbuilder

json.set! :firstArtwork do
    if gallery.artworks.empty?
---
SELECT "artworks".* FROM "artworks" INNER JOIN "collected_artworks" ON "artworks"."id" = "collected_artworks"."artwork_id" WHERE "collected_artworks"."gallery_id" = $1  [["gallery_id", 5]]
SELECT  1 AS one FROM "artworks" INNER JOIN "collected_artworks" ON "artworks"."id" = "collected_artworks"."artwork_id" WHERE "collected_artworks"."gallery_id" = $1 LIMIT $2  [["gallery_id", 1], ["LIMIT", 1]]